{
  "depression": [
    {
      "id": 1,
      "question": "Describe a recent situation that made you feel overwhelmed or hopeless."
    },
    {
      "id": 2,
      "question": "What activities or hobbies used to bring you joy, and how has that changed?"
    },
    {
      "id": 3,
      "question": "How would you describe your sleep patterns and quality of sleep?"
    },
    {
      "id": 4,
      "question": "Tell us about your relationships with family and friends. How have they been affected?"
    },
    {
      "id": 5,
      "question": "Describe how your energy levels and motivation have changed recently."
    },
    {
      "id": 6,
      "question": "What thoughts or feelings do you experience when you wake up in the morning?"
    },
    {
      "id": 7,
      "question": "How do you cope with difficult emotions or situations?"
    },
    {
      "id": 8,
      "question": "What would you like to change about your current mental state?"
    }
  ],
  "anxiety": [
    {
      "id": 1,
      "question": "Describe a situation that triggers your anxiety. What happens physically and emotionally?"
    },
    {
      "id": 2,
      "question": "How do you typically respond when you feel anxious or worried?"
    },
    {
      "id": 3,
      "question": "What situations or places do you avoid because of anxiety?"
    },
    {
      "id": 4,
      "question": "Describe how anxiety affects your ability to focus or complete tasks."
    },
    {
      "id": 5,
      "question": "Tell us about your sleep patterns and how anxiety might be affecting them."
    },
    {
      "id": 6,
      "question": "How does anxiety impact your relationships with others?"
    },
    {
      "id": 7,
      "question": "What physical symptoms do you experience when anxious?"
    },
    {
      "id": 8,
      "question": "What strategies have you tried to manage your anxiety, and how effective were they?"
    }
  ],
  "stress": [
    {
      "id": 1,
      "question": "Describe a recent situation that made you feel stressed or overwhelmed."
    },
    {
      "id": 2,
      "question": "How do you typically respond to stressful situations?"
    },
    {
      "id": 3,
      "question": "What are the main sources of stress in your life right now?"
    },
    {
      "id": 4,
      "question": "How does stress affect your physical health and well-being?"
    },
    {
      "id": 5,
      "question": "Describe how stress impacts your work or daily responsibilities."
    },
    {
      "id": 6,
      "question": "What coping mechanisms do you use when feeling stressed?"
    },
    {
      "id": 7,
      "question": "How does stress affect your relationships with others?"
    },
    {
      "id": 8,
      "question": "What changes would help reduce your stress levels?"
    }
  ],
  "ptsd": [
    {
      "id": 1,
      "question": "Can you describe the traumatic event you experienced? (Only share what you're comfortable with)"
    },
    {
      "id": 2,
      "question": "How do you feel when you're reminded of the traumatic event?"
    },
    {
      "id": 3,
      "question": "Describe how the trauma has affected your daily life and functioning."
    },
    {
      "id": 4,
      "question": "What triggers cause you to relive the traumatic experience?"
    },
    {
      "id": 5,
      "question": "How has the trauma affected your relationships with others?"
    },
    {
      "id": 6,
      "question": "Describe your sleep patterns and any nightmares or flashbacks you experience."
    },
    {
      "id": 7,
      "question": "How do you cope with the emotional impact of the trauma?"
    },
    {
      "id": 8,
      "question": "What support systems or resources have been helpful in your recovery?"
    }
  ]
}

